4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Inc/stm32mp2xx_hal_tmpsens.h
/**
  ******************************************************************************
  * @file    stm32mp1xx_hal_tmpsens.h
  * @author  MCD Application Team
  * @version V0.0.1
  * @date    01-July-2016
  * @brief   Header file of TMPSENS HAL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP1xx_HAL_TMPSENS_H
#define __STM32MP1xx_HAL_TMPSENS_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp1xx_hal_def.h"

/** @addtogroup STM32MP1xx_HAL_Driver
  * @{
  */

/** @addtogroup TMPSENS
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup TMPSENS_Exported_Types TMPSENS Exported Types
  * @{
  */

/**
  * @brief  TMPSENS Init structure definition
  */
typedef struct
{
  uint32_t QuickMeasure;  /*!< Specifies the quick measure option selection of
                               the TMPSENSerature sensor.
                               This parameter can be a value of
                               @ref TMPSENS_QUIKMEAS */

  uint32_t RefClock;      /*!< Specifies the reference clock selection of the
                               TMPSENSerature sensor.
                               This parameter can be a value of @ref
                               TMPSENS_REFCLKSEL */

  uint32_t TriggerInput;  /*!< Specifies the trigger input of the TMPSENSerature
                               sensor.
                               This parameter can be a value of @ref
                               TMPSENS_TriggerConfig */

  uint32_t SamplingTime;  /*!< Specifies the sampling time configuration.
                               This parameter can be a value of @ref
                               TMPSENS_SMP_TIME */

  uint32_t Divider;       /*!< Specifies the high speed clock divider ratio */

  uint32_t InterruptSource; /*!< Specifies the interrupt source of the
                                 TMPSENSerature sensor.
                                 This parameter can be a value of @ref
                                 TMPSENS_InterruptSource_Definitions */

  uint32_t HighInterruptThreshold;  /*!< Specifies the high Interrupt threshold
                                         of the TMPSENSerature sensor */

  uint32_t LowInterruptThreshold; /*!<  Specifies the low Interrupt threshold of
                                        the TMPSENSerature sensor */
#ifdef __STM32MP1xx_H
  uint32_t WakeupTarget;  /*!< Specifies the Wakeup Target.
                               This parameter can be a value of @ref
                               TMPSENS_WakeupTarget_Definitions */
#endif
}TMPSENS_InitTypeDef;


/**
  * @brief  TMPSENS Measure structure definition
  */
typedef struct
{
  int32_t Ts1_Sample;    /*!< Specifies the measured sample number for TMPSENS1
                              (for debug purposes) */
  int32_t Ts1_Fmt;       /*!< Specifies the measured frequency for TMPSENS1
                              (for debug purposes) */
  int32_t Ts1_Temp;      /*!< Specifies the measured temperature for TMPSENS1 */
  uint32_t Ts1_Count_R;   /*!< Specifies the number of reads before getting a SW
                               measured temperature for TMPSENS1
                               (for debug purposes)*/
}TMPSENS_MeasureTypeDef;

/**
  * @brief  HAL State structures definition
  */
typedef enum
{
  HAL_TMPSENS_STATE_RESET       = 0x00, /*!< TMPSENS not yet initialized or
                                             disabled */
  HAL_TMPSENS_STATE_READY       = 0x01, /*!< TMPSENS initialized and ready for
                                             use */
  HAL_TMPSENS_STATE_CALIBBUSY   = 0x02, /*!< TMPSENS is enabled in auto
                                             calibration mode */
  HAL_TMPSENS_STATE_BUSY        = 0x03, /*!< TMPSENS is running */
  HAL_TMPSENS_STATE_BUSY_LOCKED = 0x04  /*!< TMPSENS is running and the
                                             configuration is locked */
}HAL_TMPSENS_StateTypeDef;

/**
  * @brief  TMPSENS Handle Structure definition
  */
typedef struct
{
  TMPSENS_TypeDef         *Instance;    /*!< Register base address */
  TMPSENS_InitTypeDef     Init;         /*!< TMPSENS required parameters */
  TMPSENS_MeasureTypeDef  Measure;      /*!< Measured values */
  HAL_LockTypeDef         Lock;         /*!< Locking object */
  __IO HAL_TMPSENS_StateTypeDef  State; /*!< COMP communication state */
} TMPSENS_HandleTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup TMPSENS_Exported_Constants TMPSENS Exported Constants
  * @{
  */

/** @defgroup TMPSENS_TriggerConfig  TMPSENS Trigger Configuration
  * @{
  */

/* @brief No Hardware trigger detection */
#define TMPSENS_TRIGGER_HW_NONE   (0U)

/* @brief External Interrupt Mode with LPTIMER1 trigger detection */
#define TMPSENS_TRIGGER_LPTIMER1  TMPSENS_CFGR1_TS1_INTRIG_SEL_0

/* @brief External Interrupt Mode with LPTIMER2 trigger detection */
#define TMPSENS_TRIGGER_LPTIMER2  TMPSENS_CFGR1_TS1_INTRIG_SEL_1

/* @brief External Interrupt Mode with LPTIMER3 trigger detection */
#define TMPSENS_TRIGGER_LPTIMER3  ((uint32_t)TMPSENS_CFGR1_TS1_INTRIG_SEL_0 \
                                   | TMPSENS_CFGR1_TS1_INTRIG_SEL_1)

/* @brief External Interrupt Mode with EXTI13 trigger detection */
#define TMPSENS_TRIGGER_SYSCFG_EXTI13 TMPSENS_CFGR1_TS1_INTRIG_SEL_2

/* @brief No Hardware trigger detection on continuous mode */
#define TMPSENS_TRIGGER_HW_NONE_CONT  ((uint32_t)TMPSENS_CFGR1_TS1_INTRIG_SEL_0 \
                                       | TMPSENS_CFGR1_TS1_INTRIG_SEL_1 \
                                       | TMPSENS_CFGR1_TS1_INTRIG_SEL_2)
/**
  * @}
  */

