4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Inc/stm32mp2xx_hal_tmpsens.h
/** @defgroup TMPSENS_QUIKMEAS  TMPSENS Quick Measurement
  * @{
  */
#define TMPSENS_QUICKMEAS_ENABLE \
          TMPSENS_CFGR1_Q_MEAS_OPT      /*!< Enable the Quick Measure (Measure
                                             without calibration) */
#define TMPSENS_QUICKMEAS_DISABLE (0U)  /*!< Disable the Quick Measure (Measure
                                             with calibration) */
/**
  * @}
  */

/** @defgroup TMPSENS_REFCLKSEL   TMPSENS Reference Clock Selection
  * @{
  */
#define TMPSENS_REFCLKSEL_LSE \
          TMPSENS_CFGR1_REFCLK_SEL  /*!< Low speed REF clock (LSE) */
#define TMPSENS_REFCLKSEL_PCLK (0U) /*!< High speed REF clock (PCLK) */

/**
  * @}
  */

/** @defgroup TMPSENS_SMP_TIME   TMPSENS Sampling Time
  * @{
  */
#define TMPSENS_SMP_TIME_1_CYCLE    ((uint32_t)(0x00000000 | TMPSENS_CFGR1_TS1_SMP_TIME_0))                     /*!< 1 clock cycle for the sampling time  */
#define TMPSENS_SMP_TIME_2_CYCLE    ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_1))                                  /*!< 2 clock cycle for the sampling time  */
#define TMPSENS_SMP_TIME_3_CYCLE    ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_0 | TMPSENS_CFGR1_TS1_SMP_TIME_1))   /*!< 3 clock cycle for the sampling time  */
#define TMPSENS_SMP_TIME_4_CYCLE    ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_2))                                  /*!< 4 clock cycle for the sampling time  */
#define TMPSENS_SMP_TIME_5_CYCLE    ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_0 | TMPSENS_CFGR1_TS1_SMP_TIME_2))   /*!< 5 clock cycle for the sampling time  */
#define TMPSENS_SMP_TIME_6_CYCLE    ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_1 | TMPSENS_CFGR1_TS1_SMP_TIME_2))   /*!< 6 clock cycle for the sampling time  */
#define TMPSENS_SMP_TIME_7_CYCLE    ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_0 | TMPSENS_CFGR1_TS1_SMP_TIME_1 | TMPSENS_CFGR1_TS1_SMP_TIME_2))     /*!< 7 clock cycle for the sampling time  */
#define TMPSENS_SMP_TIME_8_CYCLE    ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_3))                                  /*!< 8 clock cycle for the sampling time  */
#define TMPSENS_SMP_TIME_9_CYCLE    ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_0 | TMPSENS_CFGR1_TS1_SMP_TIME_3))   /*!< 9 clock cycle for the sampling time  */
#define TMPSENS_SMP_TIME_10_CYCLE   ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_1 | TMPSENS_CFGR1_TS1_SMP_TIME_3))   /*!< 10 clock cycle for the sampling time */
#define TMPSENS_SMP_TIME_11_CYCLE   ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_0 | TMPSENS_CFGR1_TS1_SMP_TIME_1 | TMPSENS_CFGR1_TS1_SMP_TIME_3))     /*!< 11 clock cycle for the sampling time */
#define TMPSENS_SMP_TIME_12_CYCLE   ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_2 | TMPSENS_CFGR1_TS1_SMP_TIME_3))   /*!< 12 clock cycle for the sampling time */
#define TMPSENS_SMP_TIME_13_CYCLE   ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_0 | TMPSENS_CFGR1_TS1_SMP_TIME_2 | TMPSENS_CFGR1_TS1_SMP_TIME_3))     /*!< 13 clock cycle for the sampling time */
#define TMPSENS_SMP_TIME_14_CYCLE   ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_1 | TMPSENS_CFGR1_TS1_SMP_TIME_2 | TMPSENS_CFGR1_TS1_SMP_TIME_3))     /*!< 14 clock cycle for the sampling time */
#define TMPSENS_SMP_TIME_15_CYCLE   ((uint32_t)(TMPSENS_CFGR1_TS1_SMP_TIME_0 | TMPSENS_CFGR1_TS1_SMP_TIME_1 | TMPSENS_CFGR1_TS1_SMP_TIME_2 | TMPSENS_CFGR1_TS1_SMP_TIME_3)) /*!< 15 clock cycle for the sampling time */

/**
  * @}
  */
/** @defgroup TMPSENS_InterruptSource_Definitions  TMPSENS Interrupt Source Definitions
  * @{
  */
#define TMPSENS_ITSRC_HIGH      TMPSENS_ITENR_TS1_ITHEN
#define TMPSENS_ITSRC_LOW       TMPSENS_ITENR_TS1_ITLEN
#define TMPSENS_ITSRC_END       TMPSENS_ITENR_TS1_ITEEN
#define TMPSENS_ITSRC_ASYN_HIGH TMPSENS_ITENR_TS1_AITHEN
#define TMPSENS_ITSRC_ASYN_LOW  TMPSENS_ITENR_TS1_AITLEN
#define TMPSENS_ITSRC_ASYN_END  TMPSENS_ITENR_TS1_AITEEN

/**
  * @}
  */

/** @defgroup TMPSENS_WakeupTarget_Definitions TMPSENS Wakeup Target Definitions
  * @{
  */
#define TMPSENS_WAKEUPTARGET_CPU1 (1U)
#define TMPSENS_WAKEUPTARGET_CPU2 (2U)
/**
  * @}
  */
/** @defgroup TMPSENS_Flag TMPSENS Flag
  * @{
  */
#define TMPSENS_FLAG_TS1_ITEF   TMPSENS_SR_TS1_ITEF   /*!< Interrupt flag for end of measure for TMPSENS1 */
#define TMPSENS_FLAG_TS1_ITLF   TMPSENS_SR_TS1_ITLF   /*!< Interrupt flag for low threshold for TMPSENS1  */
#define TMPSENS_FLAG_TS1_ITHF   TMPSENS_SR_TS1_ITHF   /*!< Interrupt flag for high threshold for TMPSENS1 */
#define TMPSENS_FLAG_TS1_AITEF  TMPSENS_SR_TS1_AITEF  /*!< Asynchronous Interrupt flag for end of measure for TMPSENS1 */
#define TMPSENS_FLAG_TS1_AITLF  TMPSENS_SR_TS1_AITLF  /*!< Asynchronous Interrupt flag for low threshold for TMPSENS1  */
#define TMPSENS_FLAG_TS1_AITHF  TMPSENS_SR_TS1_AITHF  /*!< Asynchronous Interrupt flag for high threshold for TMPSENS1 */
#define TMPSENS_FLAG_TS1_RDY    TMPSENS_SR_TS1_RDY    /*!< Ready flag for TMPSENS1 */

/**
  * @}
  */
/** @defgroup TMPSENS_IT_CLEAR Flags  TMPSENS Interruption Clear Flags
  * @{
  */
#define TMPSENS_CLEAR_TS1_CITEF   TMPSENS_ICIFR_TS1_CITEF   /*!< Clear Interrupt flag for end of measure for TMPSENS1 */
#define TMPSENS_CLEAR_TS1_CITLF   TMPSENS_ICIFR_TS1_CITLF   /*!< Clear Interrupt flag for low threshold for TMPSENS1  */
#define TMPSENS_CLEAR_TS1_CITHF   TMPSENS_ICIFR_TS1_CITHF   /*!< Clear Interrupt flag for high threshold for TMPSENS1 */
#define TMPSENS_CLEAR_TS1_CAITEF  TMPSENS_ICIFR_TS1_CAITEF  /*!< Clear Asynchronous Interrupt flag for end of measure for TMPSENS1 */
#define TMPSENS_CLEAR_TS1_CAITLF  TMPSENS_ICIFR_TS1_CAITLF  /*!< Clear Asynchronous Interrupt flag for low threshold for TMPSENS1  */
#define TMPSENS_CLEAR_TS1_CAITHF  TMPSENS_ICIFR_TS1_CAITHF  /*!< Clear Asynchronous Interrupt flag for high threshold for TMPSENS1 */

/**
  * @}
  */
/** @defgroup TMPSENS_Interrupts_Definitions TMPSENS Interrupts Definitions
  * @{
  */
#define TMPSENS_IT_TS1_ITEEN  TMPSENS_ITENR_TS1_ITEEN   /*!< Enable interrupt flag for end of measure for TMPSENS1 */
#define TMPSENS_IT_TS1_ITLEN  TMPSENS_ITENR_TS1_ITLEN   /*!< Enable interrupt flag for low threshold for TMPSENS1  */
#define TMPSENS_IT_TS1_ITHEN  TMPSENS_ITENR_TS1_ITHEN   /*!< Enable interrupt flag for high threshold for TMPSENS1 */
#define TMPSENS_IT_TS1_AITEEN TMPSENS_ITENR_TS1_AITEEN  /*!< Enable asynchronous interrupt flag for end of measure for TMPSENS1 */
#define TMPSENS_IT_TS1_AITLEN TMPSENS_ITENR_TS1_AITLEN  /*!< Enable asynchronous interrupt flag for low threshold for TMPSENS1  */
#define TMPSENS_IT_TS1_AITHEN TMPSENS_ITENR_TS1_AITHEN  /*!< Enable asynchronous interrupt flag for high threshold for TMPSENS1 */
/**
  * @}
  */

/**
  * @}
  */
/* Exported macros -----------------------------------------------------------*/
/** @defgroup TMPSENS_Exported_Macros TMPSENS Exported Macros
  * @{
  */

