4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Inc/stm32mp2xx_hal_tmpsens.h
/** @brief  Reset TMPSENS handle state
  * @param  __HANDLE__ TMPSENS handle.
  * @retval None
  */
#define __HAL_TMPSENS_RESET_HANDLE_STATE(__HANDLE__)  \
        ((__HANDLE__)->State = HAL_TMPSENS_STATE_RESET)

/**
  * @brief  Enable the specified TMPSENSerature sensor
  * @param  __HANDLE__ TMPSENS handle.
  * @retval None
  */
#define __HAL_TMPSENS_ENABLE(__HANDLE__)  \
        SET_BIT((__HANDLE__)->Instance->CFGR1, TMPSENS_CFGR1_TS1_EN)

/**
  * @brief  Disable the specified TMPSENSerature sensor
  * @param  __HANDLE__ TMPSENS handle.
  * @retval None
  */
#define __HAL_TMPSENS_DISABLE(__HANDLE__) \
        CLEAR_BIT((__HANDLE__)->Instance->CFGR1, TMPSENS_CFGR1_TS1_EN)

#if defined(CORE_CA7)
/**
  * @brief  Enable the TMPSENS EXTI line in interrupt mode
  * @retval None
  */
#define __HAL_TMPSENS_EXTI_ENABLE_IT()  \
        SET_BIT(EXTI_C1->IMR3,TMPSENS_EXTI_LINE_TMPSENS1)

/**
  * @brief  Disable the TMPSENS EXTI line in interrupt mode
  * @retval None
  */
#define __HAL_TMPSENS_EXTI_DISABLE_IT() \
        CLEAR_BIT(EXTI_C1->IMR3,TMPSENS_EXTI_LINE_TMPSENS1)

/**
  * @brief  Enable the TMPSENS EXTI Line in event mode
  * @retval None
  */
#define __HAL_TMPSENS_EXTI_ENABLE_EVENT() \
        SET_BIT(EXTI_C1->EMR3,TMPSENS_EXTI_LINE_TMPSENS1)

/**
  * @brief  Disable the TMPSENS EXTI Line in event mode
  * @retval None
  */
#define __HAL_TMPSENS_EXTI_DISABLE_EVENT()  \
        CLEAR_BIT(EXTI_C1->EMR3, TMPSENS_EXTI_LINE_TMPSENS1)

#elif defined(CORE_CM4)

/**
  * @brief  Enable the TMPSENS EXTI line in interrupt mode
  * @retval None
  */
#define __HAL_TMPSENS_EXTI_ENABLE_IT()  \
        SET_BIT(EXTI_C2->IMR3,TMPSENS_EXTI_LINE_TMPSENS1)

/**
  * @brief  Disable the TMPSENS EXTI line in interrupt mode
  * @retval None
  */
#define __HAL_TMPSENS_EXTI_DISABLE_IT() \
        CLEAR_BIT(EXTI_C2->IMR3,TMPSENS_EXTI_LINE_TMPSENS1)


/**
  * @brief  Enable the TMPSENS EXTI Line in event mode
  * @retval None
  */
#define __HAL_TMPSENS_EXTI_ENABLE_EVENT() \
        SET_BIT(EXTI_C2->EMR3,TMPSENS_EXTI_LINE_TMPSENS1)


/**
  * @brief  Disable the TMPSENS EXTI Line in event mode
  * @retval None
  */
#define __HAL_TMPSENS_EXTI_DISABLE_EVENT()  \
        CLEAR_BIT(EXTI_C2->EMR3, TMPSENS_EXTI_LINE_TMPSENS1)

#endif /* CORE_CM4 */

/** @brief  Checks whether the specified TMPSENS flag is set or not.
  * @param  __HANDLE__ specifies the TMPSENS Handle.
  * @param  __FLAG__ specifies the flag to check.
  *        This parameter can be one of the following values:
  *            @arg TMPSENS_FLAG_TS1_ITEF:  Interrupt flag for end of measure for TMPSENS1
  *            @arg TMPSENS_FLAG_TS1_ITLF:  Interrupt flag for low threshold for TMPSENS1
  *            @arg TMPSENS_FLAG_TS1_ITHF:  Interrupt flag for high threshold for TMPSENS1
  *            @arg TMPSENS_FLAG_TS1_AITLF: Asynchronous Interrupt flag for low threshold for TMPSENS1
  *            @arg TMPSENS_FLAG_TS1_AITLF: Asynchronous Interrupt flag for low threshold for TMPSENS1
  *            @arg TMPSENS_FLAG_TS1_AITLF: Asynchronous Interrupt flag for low threshold for TMPSENS1
  *            @arg TMPSENS_FLAG_TS1_RDY:   Ready flag for TMPSENS1
  *            @retval The new state of __FLAG__ (SET or RESET).
  */
#define __HAL_TMPSENS_GET_FLAG(__HANDLE__, __FLAG__)  \
        (((((__HANDLE__)->Instance->SR &(__FLAG__)) == (__FLAG__)))? SET : RESET)


/** @brief  Clears the specified TMPSENS pending flag.
  * @param  __HANDLE__ specifies the TMPSENS Handle.
  * @param  __FLAG__ specifies the flag to check.
  *          This parameter can be any combination of the following values:
  *            @arg TMPSENS_CLEAR_TS1_CITEF: Clear Interrupt flag for end of measure for TMPSENS1
  *            @arg TMPSENS_CLEAR_TS1_CITLF: Clear Interrupt flag for low threshold for TMPSENS1
  *            @arg TMPSENS_CLEAR_TS1_CITHF: Clear Interrupt flag for high threshold for TMPSENS1
  *            @arg TMPSENS_CLEAR_TS1_CAITLF: Clear Asynchronous Interrupt flag for low threshold for TMPSENS1
  *            @arg TMPSENS_CLEAR_TS1_CAITLF: Clear Asynchronous Interrupt flag for low threshold for TMPSENS1
  *            @arg TMPSENS_CLEAR_TS1_CAITLF: Clear Asynchronous Interrupt flag for low threshold for TMPSENS1
  * @retval None
  */
#define __HAL_TMPSENS_CLEAR_FLAG(__HANDLE__, __FLAG__)  \
        ((__HANDLE__)->Instance->ICIFR  = (__FLAG__))


/** @brief  Enable the specified TMPSENS interrupt.
  * @param  __HANDLE__ specifies the TMPSENS Handle.
  * @param  __INTERRUPT__ specifies the TMPSENS interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg TMPSENS_IT_TS1_ITEEN :Enable interrupt flag for end of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_ITLEN :Enable interrupt flag for low of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_ITHEN :Enable interrupt flag for high of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_AITEEN :Enable asynchronous interrupt flag for end of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_AITLEN :Enable asynchronous interrupt flag for low of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_AITHEN :Enable asynchronous interrupt flag for high of measure for TMPSENS1
  * @retval None
  */
#define __HAL_TMPSENS_ENABLE_IT(__HANDLE__, __INTERRUPT__)  \
        SET_BIT((__HANDLE__)->Instance->ITENR, __INTERRUPT__)


/** @brief  Disable the specified TMPSENS interrupt.
  * @param  __HANDLE__ specifies the TMPSENS Handle.
  * @param  __INTERRUPT__ specifies the TMPSENS interrupt source to enable.
  *          This parameter can be one of the following values:
  *            @arg TMPSENS_IT_TS1_ITEEN :Enable interrupt flag for end of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_ITLEN :Enable interrupt flag for low of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_ITHEN :Enable interrupt flag for high of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_AITEEN :Enable asynchronous interrupt flag for end of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_AITLEN :Enable asynchronous interrupt flag for low of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_AITHEN :Enable asynchronous interrupt flag for high of measure for TMPSENS1
  * @retval None
  */
#define __HAL_TMPSENS_DISABLE_IT(__HANDLE__,__INTERRUPT__)  \
        CLEAR_BIT((__HANDLE__)->Instance->ITENR, __INTERRUPT__)


/** @brief  Check whether the specified TMPSENS interrupt source is enabled or not.
  * @param __HANDLE__ TMPSENS handle.
  * @param __INTERRUPT__ TMPSENS interrupt source to check
  *          This parameter can be one of the following values:
  *            @arg TMPSENS_IT_TS1_ITEEN :Enable interrupt flag for end of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_ITLEN :Enable interrupt flag for low of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_ITHEN :Enable interrupt flag for high of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_AITEEN :Enable asynchronous interrupt flag for end of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_AITLEN :Enable asynchronous interrupt flag for low of measure for TMPSENS1
  *            @arg TMPSENS_IT_TS1_AITHEN :Enable asynchronous interrupt flag for high of measure for TMPSENS1
  * @retval State of interruption (SET or RESET)
  */
#define __HAL_TMPSENS_GET_IT_SOURCE(__HANDLE__, __INTERRUPT__)  \
        (( ((__HANDLE__)->Instance->ITENR & (__INTERRUPT__)) == (__INTERRUPT__) \
        )? SET : RESET)


/** @brief  Check whether the specified TMPSENS REFCLK is selected
  * @param __HANDLE__ TMPSENS handle.
  * @param __REFCLK__ TMPSENS reference clock to check
  *          This parameter can be one of the following values:
  * @arg TMPSENS_REFCLKSEL_LSE:   Low speed REF clock
  * @arg TMPSENS_REFCLKSEL_PCLK:  High speed REF clock
  * @retval State of the REF clock tested (SET or RESET)
  */
#define __HAL_TMPSENS_GET_REFCLK(__HANDLE__, __REFCLK__)  \
        (( ((__HANDLE__)->Instance->CFGR1 & (__REFCLK__)) == (__REFCLK__) \
        )? SET : RESET)

/** @brief  Check whether the specified TMPSENS TRIGGER is selected
  * @param __HANDLE__ TMPSENS handle.
  * @param __TRIGGER__ TMPSENS input trigger to check
  *          This parameter can be one of the following values:
  * @arg TMPSENS_TRIGGER_HW_NONE:       No HW trigger (SW trigger)
  * @arg TMPSENS_TRIGGER_LPTIMER1:      LPTIMER1 trigger
  * @arg TMPSENS_TRIGGER_LPTIMER2:      LPTIMER2 trigger
  * @arg TMPSENS_TRIGGER_LPTIMER3:      LPTIMER3 trigger
  * @arg TMPSENS_TRIGGER_SYSCFG_EXTI13: EXTI13 trigger
  * @retval State of the input TRIGGER tested (SET or RESET)
  */
#define __HAL_TMPSENS_GET_TRIGGER(__HANDLE__, __TRIGGER__)  \
    (( ((__HANDLE__)->Instance->CFGR1 & (TMPSENS_CFGR1_TS1_INTRIG_SEL)) == (__TRIGGER__) \
     )? SET : RESET)
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup TMPSENS_Exported_Functions
  * @{
  */

/** @addtogroup TMPSENS_Exported_Functions_Group1
  * @{
  */
/* Initialization and de-initialization functions  **********************************/
HAL_StatusTypeDef HAL_TMPSENS_Init(TMPSENS_HandleTypeDef *hTMPSENS);
HAL_StatusTypeDef HAL_TMPSENS_DeInit (TMPSENS_HandleTypeDef *hTMPSENS);
void              HAL_TMPSENS_MspInit(TMPSENS_HandleTypeDef *hTMPSENS);
void              HAL_TMPSENS_MspDeInit(TMPSENS_HandleTypeDef *hTMPSENS);
/**
  * @}
  */

/* IO operation functions  *****************************************************/
/** @addtogroup TMPSENS_Exported_Functions_Group2
  * @{
  */
HAL_StatusTypeDef HAL_TMPSENS_Start(TMPSENS_HandleTypeDef *hTMPSENS);
HAL_StatusTypeDef HAL_TMPSENS_Stop(TMPSENS_HandleTypeDef *hTMPSENS);
HAL_StatusTypeDef HAL_TMPSENS_GetTMPSENS(TMPSENS_HandleTypeDef *hTMPSENS);
HAL_StatusTypeDef HAL_TMPSENS_Start_IT(TMPSENS_HandleTypeDef *hTMPSENS);
HAL_StatusTypeDef HAL_TMPSENS_Stop_IT(TMPSENS_HandleTypeDef *hTMPSENS);
void              HAL_TMPSENS_IRQHandler(TMPSENS_HandleTypeDef *hTMPSENS);
/* Callback in Interrupt mode */
void              HAL_TMPSENS_EndCallback(TMPSENS_HandleTypeDef *hTMPSENS);
void              HAL_TMPSENS_LowCallback(TMPSENS_HandleTypeDef *hTMPSENS);
void              HAL_TMPSENS_HighCallback(TMPSENS_HandleTypeDef *hTMPSENS);
void              HAL_TMPSENS_AsyncEndCallback(TMPSENS_HandleTypeDef *hTMPSENS);
void              HAL_TMPSENS_AsyncLowCallback(TMPSENS_HandleTypeDef *hTMPSENS);
void              HAL_TMPSENS_AsyncHighCallback(TMPSENS_HandleTypeDef *hTMPSENS);
/**
  * @}
  */

/* Peripheral Control functions  ************************************************/
/** @addtogroup TMPSENS_Exported_Functions_Group3
  * @{
  */

/**
  * @}
  */

