4ms/metamodule/firmware-mp2/lib/stm32-hal/stm32mp2/Inc/stm32mp2xx_hal_tmpsens.h
/* Peripheral State functions  **************************************************/
/** @addtogroup TMPSENS_Exported_Functions_Group4
  * @{
  */

/**
  * @}
  */

/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup TMPSENS_Private_Constants TMPSENS Private Constants
  * @{
  */
/** @defgroup TMPSENS_ExtiLine TMPSENS EXTI Lines
  * @{
  */
#if defined(STM32MP1)
#define TMPSENS_EXTI_LINE_TMPSENS1           (EXTI_IMR3_IM72)  /*!< EXTI line 72 connected to TMPSENS1 output */
#endif
/**
  * @}
  */

/** @defgroup TMPSENS_IT_Type TMPSENS IT Type
  * @{
  */
#define TMPSENS_IT_ASYNC  (TMPSENS_IT_TS1_AITEEN | TMPSENS_IT_TS1_AITLEN | TMPSENS_IT_TS1_AITHEN) /*!< TEMPSENS ASYNC IT */
#define TMPSENS_IT_SYNC   (TMPSENS_IT_TS1_ITEEN | TMPSENS_IT_TS1_ITLEN | TMPSENS_IT_TS1_ITHEN)    /*!< TEMPSENS SYNC IT */
/**
  * @}
  */


/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup TMPSENS_Private_Macros TMPSENS Private Macros
  * @{
  */

/** @defgroup TMPSENS_IS_TMPSENS_Definitions  TMPSENS Private macros to check input parameters
  * @{
  */
#define IS_TMPSENS_QUICKMEAS(__SEL__)   (((__SEL__) == TMPSENS_QUICKMEAS_DISABLE) || \
                                         ((__SEL__) == TMPSENS_QUICKMEAS_ENABLE))

#define IS_TMPSENS_REFCLK(__SEL__)      (((__SEL__) == TMPSENS_REFCLKSEL_LSE) || \
                                         ((__SEL__) == TMPSENS_REFCLKSEL_PCLK))


#define IS_TMPSENS_TRIGGERINPUT(__INPUT__)  (((__INPUT__) == TMPSENS_TRIGGER_HW_NONE)   || \
                                             ((__INPUT__) == TMPSENS_TRIGGER_LPTIMER1)  || \
                                             ((__INPUT__) == TMPSENS_TRIGGER_LPTIMER2)  || \
                                             ((__INPUT__) == TMPSENS_TRIGGER_LPTIMER3)  || \
                                             ((__INPUT__) == TMPSENS_TRIGGER_SYSCFG_EXTI13) || \
                                             ((__INPUT__) == TMPSENS_TRIGGER_HW_NONE_CONT))

#define IS_TMPSENS_INTERRUPTTHRESHOLD(__THRESHOLD__)  ((__THRESHOLD__) <= 0xFFFF)

#define IS_TMPSENS_DIVIDER_RATIO_NUMBER(__NUMBER__) (((__NUMBER__) >= ((uint32_t)2)) && ((__NUMBER__) <= ((uint32_t)127)))

#define IS_TMPSENS_SAMPLINGTIME(__CYCLE__)  (((__CYCLE__) == TMPSENS_SMP_TIME_1_CYCLE)  || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_2_CYCLE)    || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_3_CYCLE)    || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_4_CYCLE)    || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_5_CYCLE)    || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_6_CYCLE)    || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_7_CYCLE)    || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_8_CYCLE)    || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_9_CYCLE)    || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_10_CYCLE)   || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_11_CYCLE)   || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_12_CYCLE)   || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_13_CYCLE)   || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_14_CYCLE)   || \
                                             ((__CYCLE__) == TMPSENS_SMP_TIME_15_CYCLE))
/* All combinations of interrupts are allowed */
#define IS_TMPSENS_INTERRUPTSOURCE(__SOURCE__)  ((((__SOURCE__) & ~(TMPSENS_IT_ASYNC | TMPSENS_IT_SYNC)) == RESET) && \
                                                 (((__SOURCE__) & (TMPSENS_IT_ASYNC | TMPSENS_IT_SYNC)) != RESET))
/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32MP1xx_HAL_COMP_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
